laminar_2D/system/forces
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

// force1
// {
//     type            forces;

//     libs            ("libforces.so");

//     writeControl    timeStep;
//     timeInterval    1;

//     log             no;

//     patches         (rightWall);
//     /*rho             rhoInf;      // Indicates incompressible
//     rhoInf          1;           // Redundant for incompressible*/
//     CofR            (0 0 0);  // Axle midpoint on ground
//     pitchAxis       (0 1 0);
//    /*  magUInf         20;
//     lRef            1.42;        // Wheelbase length
//     Aref            0.75;        // Estimated
   
//     binData
//     {
//         nBin        20;          // output data into 20 bins
//         direction   (1 0 0);     // bin direction
//         cumulative  yes;
//     }
//     */
// }

forcesProbes
{
    type probes;
    libs ("libsample.so");
    writeControl timeStep;
    writeInterval   1;
    fields 
    (
        p
    );
    probeLocations
    (
        (1.610 0.005 0.003)
        (1.610 0.005 0.015)
        (1.610 0.005 0.030)
        (1.610 0.005 0.080)
    );
}

// ************************************************************************* //
