laminar_2D/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

cp -r 0.org 0
# Get application name
application=$(getApplication)

runApplication blockMesh
runApplication setFields
runApplication $application

touch a.foam

#------------------------------------------------------------------------------
